espressif/esp-idf/components/soc/esp32p4/include/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x108)
/** INTMTX_CORE0_DMA_IN_CH0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_M  (INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_V << INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_S)
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x10c)
/** INTMTX_CORE0_DMA_IN_CH1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_M  (INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_V << INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_S)
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x110)
/** INTMTX_CORE0_DMA_IN_CH2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_M  (INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_V << INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_S)
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x114)
/** INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_M  (INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_V << INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_S)
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x118)
/** INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_M  (INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_V << INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_S)
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x11c)
/** INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_M  (INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_V << INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_S)
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_S  0

/** INTMTX_CORE0_GPSPI2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_GPSPI2_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x120)
/** INTMTX_CORE0_GPSPI2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_GPSPI2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_GPSPI2_INTR_MAP_M  (INTMTX_CORE0_GPSPI2_INTR_MAP_V << INTMTX_CORE0_GPSPI2_INTR_MAP_S)
#define INTMTX_CORE0_GPSPI2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_GPSPI2_INTR_MAP_S  0

/** INTMTX_CORE0_AES_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_AES_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x124)
/** INTMTX_CORE0_AES_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_AES_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_AES_INTR_MAP_M  (INTMTX_CORE0_AES_INTR_MAP_V << INTMTX_CORE0_AES_INTR_MAP_S)
#define INTMTX_CORE0_AES_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_AES_INTR_MAP_S  0

/** INTMTX_CORE0_SHA_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SHA_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x128)
/** INTMTX_CORE0_SHA_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_SHA_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SHA_INTR_MAP_M  (INTMTX_CORE0_SHA_INTR_MAP_V << INTMTX_CORE0_SHA_INTR_MAP_S)
#define INTMTX_CORE0_SHA_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SHA_INTR_MAP_S  0

/** INTMTX_CORE0_RSA_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_RSA_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x12c)
/** INTMTX_CORE0_RSA_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_RSA_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_RSA_INTR_MAP_M  (INTMTX_CORE0_RSA_INTR_MAP_V << INTMTX_CORE0_RSA_INTR_MAP_S)
#define INTMTX_CORE0_RSA_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_RSA_INTR_MAP_S  0

/** INTMTX_CORE0_ECC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_ECC_INTR_MAP_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x130)
/** INTMTX_CORE0_ECC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_ECC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_ECC_INTR_MAP_M  (INTMTX_CORE0_ECC_INTR_MAP_V << INTMTX_CORE0_ECC_INTR_MAP_S)
#define INTMTX_CORE0_ECC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_ECC_INTR_MAP_S  0

/** INTMTX_CORE0_INT_STATUS_REG_0_REG register
 *  register description
 */
#define INTMTX_CORE0_INT_STATUS_REG_0_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x134)
/** INTMTX_CORE0_INT_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_INT_STATUS_0    0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_0_M  (INTMTX_CORE0_INT_STATUS_0_V << INTMTX_CORE0_INT_STATUS_0_S)
#define INTMTX_CORE0_INT_STATUS_0_V  0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_0_S  0

/** INTMTX_CORE0_INT_STATUS_REG_1_REG register
 *  register description
 */
#define INTMTX_CORE0_INT_STATUS_REG_1_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x138)
/** INTMTX_CORE0_INT_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_INT_STATUS_1    0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_1_M  (INTMTX_CORE0_INT_STATUS_1_V << INTMTX_CORE0_INT_STATUS_1_S)
#define INTMTX_CORE0_INT_STATUS_1_V  0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_1_S  0

