espressif/esp-idf/components/soc/esp32p4/include/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_INT_STATUS_REG_2_REG register
 *  register description
 */
#define INTMTX_CORE0_INT_STATUS_REG_2_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x13c)
/** INTMTX_CORE0_INT_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_INT_STATUS_2    0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_2_M  (INTMTX_CORE0_INT_STATUS_2_V << INTMTX_CORE0_INT_STATUS_2_S)
#define INTMTX_CORE0_INT_STATUS_2_V  0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_2_S  0

/** INTMTX_CORE0_CLOCK_GATE_REG register
 *  register description
 */
#define INTMTX_CORE0_CLOCK_GATE_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x140)
/** INTMTX_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Need add description
 */
#define INTMTX_CORE0_REG_CLK_EN    (BIT(0))
#define INTMTX_CORE0_REG_CLK_EN_M  (INTMTX_CORE0_REG_CLK_EN_V << INTMTX_CORE0_REG_CLK_EN_S)
#define INTMTX_CORE0_REG_CLK_EN_V  0x00000001U
#define INTMTX_CORE0_REG_CLK_EN_S  0

/** INTMTX_CORE0_INTERRUPT_REG_DATE_REG register
 *  register description
 */
#define INTMTX_CORE0_INTERRUPT_REG_DATE_REG (DR_REG_INTERRUPT_MATRIX_BASE + 0x7fc)
/** INTMTX_CORE0_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 35664144;
 *  Need add description
 */
#define INTMTX_CORE0_INTERRUPT_REG_DATE    0x0FFFFFFFU
#define INTMTX_CORE0_INTERRUPT_REG_DATE_M  (INTMTX_CORE0_INTERRUPT_REG_DATE_V << INTMTX_CORE0_INTERRUPT_REG_DATE_S)
#define INTMTX_CORE0_INTERRUPT_REG_DATE_V  0x0FFFFFFFU
#define INTMTX_CORE0_INTERRUPT_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
